from pprint import pprint

import openai
from openai import AsyncOpenAI
from pydantic import BaseModel
from avito_account.models.models import AvitoAccount
from base import settings

MODEL = "gpt-4o-2024-08-06"
client = AsyncOpenAI(api_key=settings.OPENAI_SECRET_KEY)


class MessagingSchema(BaseModel):
    answer: str


async def ai_answer_assist(chat: list, test_from_prod: bool, avito_account: AvitoAccount):
    business_context = """
    Мы предоставляем услуги по ремонту стиральных машин с выездом на дом. Обычно ремонт выполняется на месте, и стоимость варьируется от 2000 до 8000 рублей в зависимости от сложности и заменяемых запчастей. 

    - Старайся не указывать точную стоимость ремонта по переписке. Вместо этого предложи консультацию с диагностикой на месте, подчеркнув, что стоимость может варьироваться.
    - Стоимость вызова по городу - 350 рублей, загородом добавляется 25 рублей за каждый километр. (В случае выезда за город выясни расстояние.)
    - Не упоминай, что ты виртуальный помощник.

    Процесс общения с клиентом:
    1. Установление контакта
    2. Выявление потребности: Понять проблему и потребности клиента.
    3. Коммерческое предложение: Оценить стоимость работы и примерный список услуг.
    4. Закрытие заявки: Подтвердить желание клиента вызвать мастера, не будь назойливым.
    5. Если  п4 выполняется - узнать номер телефона для связи при необходимости
    6. Спросить адрес и номер телефона для связи, удобное время для вызова

    Следи за тем, чтобы завершить общение, оставляя понятное завершение:
    - Клиент подтверждает вызов мастера
    - Клиент раздумывает
    - Клиенту не подошли условия

    """
    pprint(chat)
    prompt = (
        f"История переписки: {chat}\n"
        f"Ты ассистент по ремонту стиральных машин. Ответь профессионально и дружелюбно."
        "Ты играешь роль ассистента, отвечающего на вопросы клиента, чтобы общение выглядело так, будто клиент "
        "разговаривает с настоящим менеджером.\n"
        "Избегай ненужных формальностей, если общение уже началось. После первой фразы нужно "
        "поддерживать «естественный диалог» без повторных приветствий, просто переходя к следующему шагу по сценарию"
        "несколько последующих сообщений не должны содержать одну и ту же информацию"
        f"Контекст о нашем бизнесе: {business_context}"
    )
    print(prompt)
    response = await client.chat.completions.create(
        model=MODEL,
        messages=[
            {"role": "system", "content": prompt},
        ],
        temperature=0.7,
        max_tokens=300,
        tools=[openai.pydantic_function_tool(MessagingSchema)]
    )
    if response is not None:
        message = response.choices[0].message.content
        return message
